# # =============================== Задание № 1 ========================================
# num = int(input('Введите num = '))
# dict = {}

# for numbers in range(1, num + 1):
#     dict[numbers] = numbers**2

# print(dict)

# =============================== Задание № 2 ========================================
info = input('Введите информацию о студенте через пробел:\n(Имя, Фамилия, Город, Место учебы, Оценки)\n').split()
student_dict = {'Имя', 'Фамилия', 'Город', 'Место учебы', 'Оценки'}

if len(info) >= 4:
    



for student_info in student_dict:
    print(student_info)

# =============================== Задание № 3 ========================================