# # ============================== Задача № 1 ====================================

# print('Здравствуйте, {0}! Ваш номер заказа: {1}. Приятного дня!'.format(
#     input('Имя: '),
#     input('Номер заказа: ')
# ))

# # ============================== Задача № 2 ====================================

# print('{0}! {0}, привет! Как дела, {0}? Где мои {1} рублей? {0}!'.format(
#     input('Введите имя: '),
#     input('Введите долг: ')
# ))

# ============================== Задача № 3 ====================================

number_list = []
for x in range(1,5):
    while True:
        print('Введите', x, 'число: ', end='')
        number = int(input())
        if 0 <= number <= 255:
            number_list.append(number)
            break
        else:
            print('Число должно находится в диапазоне от 0 до 255 (включительно)')

ip_address = '{0}.{1}.{2}.{3}'.format(*number_list)
print(ip_address)